---
kind: method
id: M:Autodesk.Revit.UI.UIView.GetZoomCorners
source: html/e60c8b1d-2678-4e2d-52db-c1d6567c789a.htm
---
# Autodesk.Revit.UI.UIView.GetZoomCorners Method

Gets the corners of the view's rectangle.
 The two points that define the corners of the view's rectangle in model coordinates.

## Syntax (C#)
```csharp
public IList<XYZ> GetZoomCorners()
```